<template>
  <div>
    <!DOCTYPE html>
    <html lang="uk">
      <head>
        <meta charset="UTF-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1.0" />
        <title>Політика конфіденційності</title>
      </head>
      <body>
        <header>
          <h2 class="title">Політика конфіденційності</h2>
        </header>
        <main>
          <section>
            <h2>Збір та використання інформації</h2>
            <p>
              Ми збираємо лише необхідну інформацію для надання наших послуг та
              поліпшення користувацького досвіду.
            </p>
          </section>
          <section>
            <h2>Цілі використання інформації</h2>
            <p>
              Ми використовуємо дані користувачів лише для виконання замовлень
              та надання персоналізованих послуг.
            </p>
          </section>
          <section>
            <h2>Правові підстави для обробки даних</h2>
            <p>
              Ми засновуємо обробку даних на згоді користувачів та необхідності
              виконання контракту.
            </p>
          </section>
          <section>
            <h2>Терміни зберігання даних</h2>
            <p>
              Ми зберігаємо дані користувачів лише протягом необхідного періоду
              часу для обробки замовлень.
            </p>
          </section>
          <section>
            <h2>Права користувачів</h2>
            <p>
              Користувачі мають право на доступ, виправлення та видалення своїх
              даних.
            </p>
          </section>
          <section>
            <h2>Обмін інформацією з третіми сторонами</h2>
            <p>
              Ми не передаємо дані користувачів третім сторонам без їх згоди.
            </p>
          </section>
          <section>
            <h2>Заходи безпеки</h2>
            <p>
              Ми приймаємо заходи безпеки для захисту даних користувачів від
              несанкціонованого доступу.
            </p>
          </section>
          <section>
            <h2>Зміни в політиці конфіденційності</h2>
            <p>
              Наша політика конфіденційності може періодично оновлюватися.
              Будь-які зміни будуть опубліковані на цій сторінці.
            </p>
          </section>
          <section>
            <h2>Контактна інформація</h2>
            <p>
              Якщо у вас є питання або запити щодо вашої конфіденційності, будь
              ласка, зв'яжіться з нами за адресою privacy@example.com.
            </p>
          </section>
        </main>
      </body>
    </html>
  </div>
</template>

<style lang="scss" scoped>
div {
  padding: 150px 50px;
  display: flex;
  flex-direction: column;
  align-items: center;
  justify-content: center;
  gap: 50px;

  h2 {
    font-family: "Roboto", sans-serif;
    font-size: 20px;
  }
  section {
    margin-top: 30px;
  }
}

.title {
  font-size: 30px;
}
</style>
